{
  "backend/main.mo": "Motoko canister implementing user profiles and blog CRUD with access control and author/admin permissions.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend files, components, pages, and utilities.",
  "frontend/index.css": "Tailwind base theme defining color tokens, dark mode values, and global background/foreground variables.",
  "frontend/index.html": "Main HTML entry with SEO-friendly title and favicon links for multiple icon sizes.",
  "frontend/public/robots.txt": "Robots configuration allowing most pages while blocking profile and blog editor, and linking the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing key public routes with change frequency and priority values.",
  "frontend/src/App.tsx": "React root router configuration defining all routes and rendering layout with header, footer, and theming.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, errors, and query cache clearing.",
  "frontend/src/components/brand/BrandLogo.tsx": "Logo component rendering the uploaded Marco Marketing image with size variants for header and footer.",
  "frontend/src/components/CtaButton.tsx": "Wrapper around the Button component providing a large, bold call‑to‑action style.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, navigation links, services, and contact/social links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides a responsive site header with navigation, login, SEO audit CTA, and mobile menu handling.",
  "frontend/src/components/resources/ExternalResourcesSection.tsx": "Displays categorized external tools and portfolio resources using cards with outbound links.",
  "frontend/src/components/services/PricingTable.tsx": "Shows three SEO pricing packages with feature lists and links to a full pricing guide.",
  "frontend/src/components/services/ServiceCards.tsx": "Renders a grid of service cards with icons, descriptions, and optional detail links.",
  "frontend/src/components/services/ServiceIcon.tsx": "Maps service icon keys to Lucide icons and renders the appropriate icon component.",
  "frontend/src/data/externalResources.ts": "Defines a list of external tools and portfolio resources with metadata for display.",
  "frontend/src/data/services.ts": "Exports structured service definitions including titles, descriptions, icons, and optional links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useBlog.ts": "Provides React Query hooks for CRUD operations on blog posts using the backend actor.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides React Query hooks to load and save the current user's profile via an actor API, including cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider managing AuthClient login, identity state, and related status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes, including typography and layout defaults.",
  "frontend/src/lib/markdown.tsx": "Transforms basic Markdown syntax into styled HTML using regex and renders it via dangerouslySetInnerHTML.",
  "frontend/src/lib/seo.tsx": "React hook that updates document title, meta tags, canonical link, Open Graph, Twitter tags, and optional JSON-LD.",
  "frontend/src/lib/slug.ts": "Provides functions to generate URL slugs from text and validate slug format.",
  "frontend/src/lib/structuredData.ts": "Generates JSON-LD schemas for organization, website, blog posts, FAQs, and combined schema graphs.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, structured data, and multiple content sections describing the company.",
  "frontend/src/pages/BlogEditorPage.tsx": "Provides a form to create or edit blog posts, handling slug generation, validation, and submission.",
  "frontend/src/pages/BlogIndexPage.tsx": "Displays a sorted list of blog posts with SEO metadata and navigation to create or view posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with SEO schema, author tools, and delete functionality.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, service highlights, stats, and SEO metadata.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and update their profile information.",
  "frontend/src/pages/services/LogoDesignServicesPage.tsx": "React page rendering the Logo Design Services content with SEO metadata, hero section, process steps, and CTA buttons.",
  "frontend/src/pages/services/SeoServicesPage.tsx": "React page for SEO Services including SEO metadata, hero content, pricing, and FAQ accordion with structured data.",
  "frontend/src/pages/ServicesPage.tsx": "Presents detailed service offerings, pricing, and marketing resources with SEO metadata.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing requirements, SEO strategy, design constraints, known issues, and image conversion tasks."
}